In [1]:
import pandas as pd
df = pd.read_csv('dataas.csv')
df

    name       phone
0    ram   986525415
1   sita   986888887
2  shyam  6659988525
3  rahul  9860012454

In [2]:
import pandas as pd
df = pd.read_csv('data.csv')
df

   sn   Name  Age    Address       Phone
0   1  Shyam   34  kathmandu  9860000000
1   2   Hari   23  Bhaktapur   988880000
2   3  Sabin   28      Patan   986622222
3   4    Ram   37      Bihar  9866655525
4   5   Sita   25        Ktm   986222555
5   6  Nabin   48    Bhojpur   986555552

In [5]:
df.head(3)

   sn   Name  Age    Address       Phone
0   1  Shyam   34  kathmandu  9860000000
1   2   Hari   23  Bhaktapur   988880000
2   3  Sabin   28      Patan   986622222

In [4]:
print(df.head())

   sn   Name  Age    Address       Phone
0   1  Shyam   34  kathmandu  9860000000
1   2   Hari   23  Bhaktapur   988880000
2   3  Sabin   28      Patan   986622222
3   4    Ram   37      Bihar  9866655525
4   5   Sita   25        Ktm   986222555

In [6]:
df.head()

   sn   Name  Age    Address       Phone
0   1  Shyam   34  kathmandu  9860000000
1   2   Hari   23  Bhaktapur   988880000
2   3  Sabin   28      Patan   986622222
3   4    Ram   37      Bihar  9866655525
4   5   Sita   25        Ktm   986222555

In [7]:
df.tail()

   sn   Name  Age    Address       Phone
1   2   Hari   23  Bhaktapur   988880000
2   3  Sabin   28      Patan   986622222
3   4    Ram   37      Bihar  9866655525
4   5   Sita   25        Ktm   986222555
5   6  Nabin   48    Bhojpur   986555552

In [8]:
df.tail(3)

   sn   Name  Age  Address       Phone
3   4    Ram   37    Bihar  9866655525
4   5   Sita   25      Ktm   986222555
5   6  Nabin   48  Bhojpur   986555552

In [11]:
df.iloc[0:3]

   sn   Name  Age    Address       Phone
0   1  Shyam   34  kathmandu  9860000000
1   2   Hari   23  Bhaktapur   988880000
2   3  Sabin   28      Patan   986622222

In [13]:
df.iloc[2:5+1]

   sn   Name  Age  Address       Phone
2   3  Sabin   28    Patan   986622222
3   4    Ram   37    Bihar  9866655525
4   5   Sita   25      Ktm   986222555
5   6  Nabin   48  Bhojpur   986555552

In [14]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df

     Name  Age    Address       Phone
sn
1   Shyam   34  kathmandu  9860000000
2    Hari   23  Bhaktapur   988880000
3   Sabin   28      Patan   986622222
4     Ram   37      Bihar  9866655525
5    Sita   25        Ktm   986222555
6   Nabin   48    Bhojpur   986555552

In [17]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df.loc[2:3]

     Name  Age    Address      Phone
sn
2    Hari   23  Bhaktapur  988880000
3   Sabin   28      Patan  986622222

In [18]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Name')
df['Hari':'Sita']

       sn  Age    Address       Phone
Name
Hari    2   23  Bhaktapur   988880000
Sabin   3   28      Patan   986622222
Ram     4   37      Bihar  9866655525
Sita    5   25        Ktm   986222555

In [19]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df['Name']

sn
1    Shyam
2     Hari
3    Sabin
4      Ram
5     Sita
6    Nabin
Name: Name, dtype: object

In [20]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df['Age'] == 23

sn
1    False
2     True
3    False
4    False
5    False
6    False
Name: Age, dtype: bool

In [22]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df['Address'] == 'Ktm'

sn
1    False
2    False
3    False
4    False
5     True
6    False
Name: Address, dtype: bool

In [23]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df[df['Address'] == 'Ktm']

    Name  Age Address      Phone
sn
5   Sita   25     Ktm  986222555

In [24]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df[df['Age']>30]

     Name  Age    Address       Phone
sn
1   Shyam   34  kathmandu  9860000000
4     Ram   37      Bihar  9866655525
6   Nabin   48    Bhojpur   986555552

In [25]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df[(df['Age']>30)&(df['Age']<40)]

     Name  Age    Address       Phone
sn
1   Shyam   34  kathmandu  9860000000
4     Ram   37      Bihar  9866655525

In [26]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
data = df[df['Age']>30]
data.to_csv('new_data.csv')

In [27]:
import pandas as pd
data = {'Name':['Ram','Shyam','Hari'],
       'Age':[23,24,26],
       'Address':['Ktm','Patan','Bhaktapur']}

df = pd.DataFrame(data)
df

    Name  Age    Address
0    Ram   23        Ktm
1  Shyam   24      Patan
2   Hari   26  Bhaktapur

In [32]:
import csv
data = [['Name','Age','Address'],
        ['Ram',25,'Kathmandu'],
       ['Shyam',28,'Patan'],
       ['Hari',24,'Bhaktapur']]

f = open('list_data.csv','w')
x = csv.writer(f)

for i in data:
    x.writerow(i)
    
f.close()

In [34]:
import pandas as pd
df = pd.read_csv("list_data.csv")
df

    Name  Age    Address
0    Ram   25  Kathmandu
1  Shyam   28      Patan
2   Hari   24  Bhaktapur